/***************************************************************************************************
*                    (c) Copyright 1992-2009 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          usdl_bit.h
*\Description   位操作模块，提供丰富的位操作函数
*\Log           2008.09.26    Ver 1.0    张波
*               创建文件。
***************************************************************************************************/

#ifndef _USDL_BIT_H
#define _USDL_BIT_H

#include "usdl_type.h"

/***************************************************************************************************
*宏函数
***************************************************************************************************/

/***************************************************************************************************
*\Def           BitMask
*\Description   取第pos位有效的掩码
*\Parameter     pos 位数据地址
*\Return        u8
*\Log           2008.9.18   Ver 1.0    张波
*               创建宏。
***************************************************************************************************/
#define BitMask(pos) (1ULL << (pos))

/***************************************************************************************************
*\Def           BitSet
*\Description   将src的第pos位置置位
*\Parameter     src 数据地址
*\Parameter     pos 位，从0开始计
*\Return        u8
*\Note          src和pos均为变量，不可填写指针、函数或表达式。
*\Log           2008.9.18   Ver 1.0    张波
*               创建宏。
***************************************************************************************************/
#define BitSet(src, pos)  { BitPointSet(&(src), (pos), sizeof(src)); }

/***************************************************************************************************
*\Def           BitClr
*\Description   将src的第pos位置清除
*\Parameter     src 数据地址
*\Parameter     pos 位，从0开始计
*\Return        u8
*\Note          src和pos均为变量，不可填写指针、函数或表达式。
*\Log           2008.9.18   Ver 1.0    张波
*               创建宏。
***************************************************************************************************/
#define BitClr(src, pos)  { BitPointClr(&(src), (pos), sizeof(src)); }

/***************************************************************************************************
*\Def           BitSetNot
*\Description   将src的第pos位置取反
*\Parameter     src 数据地址
*\Parameter     pos 位，从0开始计
*\Return        u8
*\Note          src和pos均为变量，不可填写指针、函数或表达式。
*\Log           2008.9.18   Ver 1.0    张波
*               创建宏。
***************************************************************************************************/
#define BitSetNot(src, pos)  { BitPointNot(&(src), (pos), sizeof(src)); }

/***************************************************************************************************
*\Function      BitPointSet
*\Description   将src指向数据的第pos位置有效。
*\Parameter     src     数据地址
*\Parameter     pos     位
*\Parameter     width   数据宽度
*\Return        void
*\Log           2008.8.22   Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
void BitPointSet(void* src, u8 pos, u8 width);

/***************************************************************************************************
*\Function      BitPointClr
*\Description   将src指向数据的第pos位置无效。
*\Parameter     src     数据地址
*\Parameter     pos     位
*\Parameter     width   数据宽度
*\Return        void
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
void BitPointClr(void* src, u8 pos, u8 width);

/***************************************************************************************************
*\Function      BitPointNot
*\Description   将src指向数据的第pos位取反。
*\Parameter     src     数据地址
*\Parameter     pos     位
*\Parameter     width   数据宽度
*\Return        void
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
void BitPointNot(void* src, u8 pos, u8 width);


/***************************************************************************************************
*\Function      BitGet
*\Description   返回value第POS位的值。
*\Parameter     value     数据地址
*\Parameter     pos     位
*\Return        u8
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8 BitGet(u64 value, u8 pos);

/***************************************************************************************************
*\Function      BitValueSet
*\Description   返回value的第pos位置有效后的值。
*\Parameter     value       数据地址
*\Parameter     pos         位
*\Return        u32
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u64 BitValueSet(u64 value, u8 pos);

/***************************************************************************************************
*\Function      BitValueClr
*\Description   返回value第pos位置无效后的值。
*\Parameter     value     数据地址
*\Parameter     pos       位
*\Return        u32
*\Log           2008.09.27    Ver 1.0   张波
*               创建函数。
***************************************************************************************************/
u64 BitValueClr(u64 value, u8 pos);

/***************************************************************************************************
*\Function      BitValueNot
*\Description   返回value第POS位取反后的值。
*\Parameter     value       数据地址
*\Parameter     pos         位
*\Return        u32
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u64 BitValueNot(u64 value, u8 pos);

/***************************************************************************************************
*\Function      BitValueGetSetNum
*\Description   返回有效位的数目。
*\Parameter     value     数据地址
*\Return        u32
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 BitValueGetSetNum(u32 value);

/***************************************************************************************************
*\Function      BitValueU8Reverse
*\Description   返回8位value逆序后的值。
*\Parameter     value     数据地址
*\Return        u8
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8 BitValueU8Reverse(u8 value);

/***************************************************************************************************
*\Function      BitValueU16Reverse
*\Description   返回16位value逆序后的值。
*\Parameter     value     数据地址
*\Return        u16
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u16 BitValueU16Reverse(u16 value);

/***************************************************************************************************
*\Function      BitValueU32Reverse
*\Description   返回32位value逆序后的值。
*\Parameter     value     数据地址
*\Return        u32
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 BitValueU32Reverse(u32 value);

/***************************************************************************************************
*\Function      BitValueReverse
*\Description   返回value的低len位反转值。
*\Parameter     value   数据地址
*\Parameter     len     低len位(0~32)
*\Return        u32
*\Note          1) Example: BitValueReverse(0x3e23L, 3) == 0x3e26
*\Log           2008.09.27    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u64 BitValueReverse(u64 value, u8 len);

/***************************************************************************************************
*\Function      ByteArrayBitSet
*\Description   设置字节数组中的某一位为1。
*\Parameter     data    字节数组
*\Parameter     index   要设置位的位置，从0开始。
*\Return        void
*\Log           2009.03.19    Ver 1.0    张波
*               创建函数
***************************************************************************************************/
void ByteArrayBitSet(u8* data, u16 index);

/***************************************************************************************************
*\Function      ByteArrayBitClr
*\Description   清除字节数组中的某一位为0。
*\Parameter     data    字节数组
*\Parameter     index   要清除的位的位置，从0开始。
*\Return        void
*\Log           2009.03.19    Ver 1.0    张波
*               创建函数
***************************************************************************************************/
void ByteArrayBitClr(u8* data, u16 index);

/***************************************************************************************************
*\Function      ByteArrayBitGet
*\Description   获取字节数组中的某一位的状态。
*\Parameter     data    字节数组
*\Parameter     index   希望获得的位的位置，从0开始
*\Return        bool    位为1时返回TRUE，位为0时返回FALSE。
*\Log           2009.03.19    Ver 1.0    张波
*               创建函数
***************************************************************************************************/
bool ByteArrayBitGet(u8* data, u16 index);

#endif /*_USDL_BIT_H*/
