/***************************************************************************************************
*                    (c) Copyright 1992-2009 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          usdl_string.h
*\Description   字符串操作模块
*\Log           2008.10.08    Ver 1.1    张波
*               创建文件。
***************************************************************************************************/

#ifndef _USDL_STRING_H
#define _USDL_STRING_H

#include "usdl_type.h"
#include "usdl_mem.h"

/***************************************************************************************************
*\Def           StrEqual
*\Description   判断两字符串是否相同。
*\Parameter     str1    字符串1
*\Parameter     str2    字符串2
*\Return        bool    是否相等
*\Log           2010.12.13    Ver 1.0    张波，张波
*               创建函数。
***************************************************************************************************/
#define StrEqual(str1, str2) (*((u8*)str1) == *((u8*)str2) && StrCmp(((u8*)str1), ((u8*)str2)) == 0)

/***************************************************************************************************
*字符串处理
***************************************************************************************************/

/***************************************************************************************************
*\Function      StrCpy
*\Description   字符串拷贝
*\Parameter     dst     目标字符串缓冲区
*\Parameter     src     源字符串
*\Return        u8*     目标串地址
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrCpy(u8* dst, const u8* src);

/***************************************************************************************************
*\Function      StrNCpy
*\Description   按长度拷贝字符串
*\Parameter     dst     目标字符串缓冲区
*\Parameter     src     源字符串
*\Parameter     n       长度
*\Return        u8*     目标字符串地址
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrNCpy(u8* dst, const u8* src, u32 n);


/***************************************************************************************************
*\Function      StrCat
*\Description   字符串连接，把源字符串连接到目标串后边
*\Parameter     dst     要链接的目标字符串
*\Parameter     str     源字符串
*\Return        u8*     目标串地址
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrCat(u8* dst, const u8* str);

/***************************************************************************************************
*\Function      StrNCat
*\Description   按指定长度连接字符串
*\Parameter     dst     目标字符串
*\Parameter     src     源字符串
*\Parameter     n       长度
*\Return        u8*     目标字符串地址
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrNCat(u8* dst, const u8* src, u32 n);

/***************************************************************************************************
*字符串统计、比较、查找
***************************************************************************************************/

/***************************************************************************************************
*\Function      StrLen
*\Description   获取字符串长度
*\Parameter     str     字符串
*\Return        u32     长度
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 StrLen(const u8* str);

/***************************************************************************************************
*\Function      StrNLen
*\Description   获取字符串的长度
*\Parameter     str     字符串
*\Parameter     max_len N的值
*\Return        u32     长度
*\Log           2011.07.21    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 StrNLen(const u8* str, u32 len);

/***************************************************************************************************
*\Function      StrCmp
*\Description   字符串比较
*\Parameter     str1    字符串1
*\Parameter     str2    字符串2
*\Return        s8      比较结果
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
s8 StrCmp(const u8* str1, const u8* str2);

/***************************************************************************************************
*\Function      StrICmp
*\Description   字符串比较函数,不区分大小写
*\Parameter     str1    字符串1
*\Parameter     str2    字符串2
*\Return        s8      比较结果
*\Note          
*\Log           2011.03.15    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
s8 StrICmp(const u8* str1, const u8* str2);

/***************************************************************************************************
*\Function      StrNCmp
*\Description   按指定长度对字符串进行比较
*\Parameter     str1    字符串1
*\Parameter     str2    字符串2
*\Parameter     n       长度
*\Return        u32     比较结果
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 StrNCmp(const u8* str1, const u8* str2, u32 n);

/***************************************************************************************************
*\Function      StrNICmp
*\Description   定长字符串比较函数,不区分大小写
*\Parameter     str1    字符串1
*\Parameter     str2    字符串2
*\Parameter     count   要比较的长度
*\Return        s8      比较结果
*\Note          
*\Log           2011.03.15    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
s8 StrNICmp(const u8* str1, const u8* str2, u32 count);

/***************************************************************************************************
*\Function      StrChr
*\Description   查找字符串s中首次出现字符c的位置
*\Parameter     str     字符串
*\Parameter     ch      字符
*\Return        u8*     指向该位置的指针
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrChr(const u8* str, u8 ch);


/***************************************************************************************************
*\Function      StrRChr
*\Description   查找字符在指定字符串中从后面开始的第一次出现的位置
*\Parameter     str     字符串
*\Parameter     ch      字符
*\Return        u8*     指向该位置的指针
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrRChr(const u8* str, u8 ch);

/***************************************************************************************************
*\Function      StrCSpn
*\Description   顺序在字符串str中搜寻与ch_set中字符的第一个相同字符，返回
*\Parameter     str     字符串
*\Parameter     ch_set  字符
*\Return        u32     这个字符在str中第一次出现的位置
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 StrCSpn(const u8* str, const u8* ch_set);

/***************************************************************************************************
*\Function      StrSpn
*\Description   返回字符串中第一个不在指定字符串中出现的字符下标
*\Parameter     str     字符串
*\Parameter     ch_set  字符集合
*\Return        u32     返回字符串开头连续包含字符串ch_set内的字符数目
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u32 StrSpn(const u8* str, const u8* ch_set);

/***************************************************************************************************
*\Function      StrStr
*\Description   在字符串中查找指定字符串的第一次出现
*\Parameter     str     字符串
*\Parameter     sub_str 子串
*\Return        u8*     出现位置的指针
*\Note
*\Log           2010.12.13    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* StrStr(const u8* str, const u8* sub_str);

/***************************************************************************************************
*\Function      Strip
*\Description   从字符串str中去除字符ch。
*\Parameter     str     字符串
*\Parameter     ch      字符
*\Return        u8*
*\Note          
*\Log           2010.12.21    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8* Strip(u8* str, u8 ch);

/***************************************************************************************************
*\Function      StrSplit
*\Description   分割字符串
*\Parameter     str
*\Parameter     split
*\Parameter     replace 要替换的字符 不替换则使用分割符
*\Parameter     result
*\Parameter     node_num result个数 ，防止溢出
*\Return        u32,分割后的个数
*\Note          
*\Log           2017.02.27    Ver 1.0    Job               
				创建函数。
***************************************************************************************************/
u32 StrSplit(u8* str, const u8 split, const u8 replace, DataNode result[], u32 node_num);
#endif /*_USDL_STRING_H*/


