/***************************************************************************************************
*                    (c) Copyright 2008-2012 Syncretize technologies co.,ltd.
*                                       All Rights Reserved
*
*\File          crc16.h
*\Description   循环冗余检验头文件
*\Note          
*\Log           2012.12.06    Ver 1.0    张波
*               创建文件。
***************************************************************************************************/
#ifndef _USDL_CRC_H
#define _USDL_CRC_H
#include "usdl_type.h"

/***************************************************************************************************
CRC32校验计算函数
***************************************************************************************************/
typedef struct
{
    unsigned long crc;
} CRC32_CTX;

void CRC32_Init(CRC32_CTX *ctx);
void CRC32_Update(CRC32_CTX *ctx, uint8_t *data, uint32_t len);
uint32_t CRC32_Final(CRC32_CTX *ctx);

/***************************************************************************************************
*\Function      CRC16
*\Description   crc16检验
*\Parameter     pData，要检验数据缓冲区
*\Parameter     nLength检验数据长度
*\Return        u16 检验值
*\Note          
*\Log           2012.12.06    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u16 Get_CRC16(u8 *pData, u32 nLength);

/***************************************************************************************************
*\Function      Get_CRC8
*\Description   
*\Parameter     bufferPtr
*\Parameter     bufferLength
*\Return        u8
*\Note          
*\Log           2015.11.12    Ver 1.0    张波
*               创建函数。
***************************************************************************************************/
u8 Get_CRC8(u8* bufferPtr, u32 bufferLength);

/***************************************************************************************************
*\Function      Get_Sum8
*\Description   8位累加和
*\Parameter     buf
*\Parameter     len
*\Return        u8
*\Note          
*\Log           2017.11.08    Ver 1.0    Job               
				创建函数。
***************************************************************************************************/
u8 Get_Sum8(u8* buf, u32 len);
/***************************************************************************************************
*\Function      Get_Sum16
*\Description   16位累加和
*\Parameter     buf
*\Parameter     len
*\Return        u16
*\Note          
*\Log           2017.11.08    Ver 1.0    Job               
				创建函数。
***************************************************************************************************/
u16 Get_Sum16(u8* buf, u32 len);

/***************************************************************************************************
*\Function      BubbleSort
*\Description   冒泡排序
*\Parameter     a
*\Parameter     len
*\Return        void
*\Note          
*\Log           2017.11.08    Ver 1.0    Job               
				创建函数。
***************************************************************************************************/
void BubbleSort(u16* a, u32 len);

/***************************************************************************************************
*\Function      Get_ExclusiveOR
*\Description   异或
*\Parameter     buf
*\Parameter     len
*\Return        u8
*\Note          
*\Log           2017.11.08    Ver 1.0    Job               
				创建函数。
***************************************************************************************************/
u8 Get_ExclusiveOR(u8* buf, u32 len);
#endif /*_USDL_CRC_H*/

